tap "domt4/autoupdate"
tap "felixkratz/formulae"
tap "ggozad/formulas"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "th-ch/youtube-music"
brew "awscli"
brew "gettext"
brew "bash"
brew "bat"
brew "icu4c@76"
brew "bfg"
brew "cloudflare-wrangler"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "fastfetch"
brew "fzf"
brew "gdb"
brew "gh"
brew "git"
brew "git-lfs"
brew "htop"
brew "icarus-verilog"
brew "icu4c@77"
brew "iproute2mac"
brew "llmfit"
brew "lua"
brew "mactop"
brew "make"
brew "maven"
brew "mvfst"
brew "neovim"
brew "nowplaying-cli"
brew "nvm"
brew "ollama"
brew "postgresql@15"
brew "postgresql@17", restart_service: :changed, link: true
brew "pyenv"
brew "python@3.10"
brew "python@3.12"
brew "rbenv"
brew "ruby"
brew "rust"
brew "spotify_player"
brew "switchaudio-osx"
brew "telnet"
brew "watch"
brew "watchman"
brew "wifi-password"
brew "zsh-completions"
brew "hashicorp/tap/terraform"
cask "codex"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "iterm2"
cask "mos@beta"
cask "obsidian"
cask "sf-symbols"
cask "th-ch/youtube-music/youtube-music"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "azemoh.one-monokai"
vscode "benjaminbenais.copilot-theme"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "esthorace.python-theme"
vscode "evzen-wybitul.magic-racket"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.colab"
vscode "guidotapia2.unicode-math-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "jprestidge.theme-material-theme"
vscode "kevinrose.vsc-python-indent"
vscode "kubescape.kubescape"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "miladfathy.dragan-color-theme"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nickfode.latex-formatter"
vscode "octref.vetur"
vscode "orepor.color-tabs-vscode-ext"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "searking.preview-vscode"
vscode "solnurkarim.html-to-css-autocompletion"
vscode "sporiley.css-auto-prefix"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.theme"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "valentjn.vscode-ltex"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.quokka-vscode"
vscode "xaver.clang-format"
vscode "zhuangtongfa.material-theme"
go "github.com/bootdotdev/bootdev"
go "golang.org/x/tools/gopls"
go "github.com/LuaanNguyen/hellogo"
go "honnef.co/go/tools/cmd/staticcheck"
